[
  {
    "id": 1,
    "principle": "Spacing",
    "subtitle": "Space practice across time > Mass practice all at once",
    "categoryId": 1,
    "gameId": 1,
    "categoryName": "Memory/Fluency",
    "related": "15",
    "questions": "When do players get opportunities to practice skills in your game?\nHow often do you want your player to practice key skills?\nHow many times will they be exposed to each key skill?\nHow much time is between the initial learning and the final “test” or implementation of knowledge?\nHow much time will it require for players to complete practicing?\nWhat is the minimum required time for one set of practice?",
    "description": "Leave some time in between practice/study/play sessions. \nDelayed reexposure/review can be very effective in learning new material. It is more damaging not to have a review at all than it is to have too much space between the initial exposure and the review.",
    "examples": "Studying for 1 hour a day for 12 days > Cramming for a test for 12 hours the day before\nPlaying Duolingo for for 20 minutes every day for 2 weeks > Playing for 7 hours on the plane on the way to Japan\nGive students a review of course material several weeks after it is first presented > Review several weeks later",
    "exampleGame": "Duolingo",
    "exampleGameUrl": "https://www.duolingo.com/",
    "exampleGameDesc": "Duolingo is a mobile app for learning languages. Duolingo encourages users to take a break in between lessons by providing incentives for “streaks” of practicing for multiple days in a row.",
    "cited": "Pashler"
  },
  {
    "id": 2,
    "principle": "Scaffolding",
    "subtitle": "Sequence instruction toward higher goals > No sequencing",
    "categoryId": 1,
    "gameId": 1,
    "categoryName": "Memory/Fluency",
    "related": "5",
    "questions": "What are all the skills in your game?\nWhat order does the player encounter them in?\nCould the sequence be adjusted to introduce more complex skills later?\nHow can the different levels of skills be presented to the players?\nHow can bigger practices be broken down into smaller pieces?",
    "description": "Structure content modularly. \nBuild upon prior concepts when introducing new concepts, and build towards a higher goal.",
    "examples": "Learn to draw contours and break objects down into shapes > Draw a human figure in high fidelity\nTeach a player to do a jump in level 1, doublejump in level 2, backflip in level 3, and double-jump backflip in level 4 > Teach double-jump backflip in level 1",
    "exampleGame": "Minecraft",
    "exampleGameUrl": "https://www.minecraft.net/en-us/",
    "exampleGameDesc": "Minecraft is a popular open-ended game in which players explore the iconic, randomly generated, blocky terrain and break down resource blocks in order to combine them to build new things. Minecraft’s advancements tree is structured in a way that it serves as a walk-through of what to do next. Previous achievements make further achievements possible, often by producing resources needed to build further items."
  },
  {
    "id": 3,
    "principle": "Exam expectations",
    "subtitle": "Students expect to be tested > No testing expected",
    "categoryId": 1,
    "gameId": 6,
    "categoryName": "Memory/Fluency",
    "related": "4, 7",
    "questions": "What does the player need to know to succeed in your game?\nDoes the player feel that those KCs are necessary?\nCan you make them feel more necessary?\nHow can players’ understanding be measured through the test?",
    "description": "Make it clear how key concepts being learned will be put to use later.",
    "examples": "Tell your 6th grade class that there will be a quiz on this reading > Tell them to do the reading because it will better them as a student\nWhen teaching a player to perform a function, provide some examples of future tasks that this skill is needed to complete (“double jump: used for collecting butterflies”) > Teach the function in a vacuum",
    "exampleGame": "FreeCodeCamp",
    "exampleGameUrl": "https://www.freecodecamp.org/",
    "exampleGameDesc": "FreeCodeCamp is a free website that teaches users web development skills through a gamified curriculum of short “learn by doing” exercises. Each lesson begins with a few paragraphs of explanatory text and visuals, followed immediately by a coding problem. The user cannot complete the lesson without solving the problem. The consistent use of this pattern perpetuates the expectation that the information being learned in the introductory text is important, and will be put to use (tested on)."
  },
  {
    "id": 4,
    "principle": "Quizzing",
    "subtitle": "Quiz for retrieval practice > Study same material",
    "categoryId": 1,
    "gameId": 6,
    "categoryName": "Memory/Fluency",
    "related": "3, 7",
    "questions": "Where do players exercise the skills they are learning in your game?\nDo they have to exercise those skills repeatedly?\nWhat are the core skills that must be tested before proceeding?",
    "description": "Re-expose players to core concepts by forcing them to recall material. \nOr pre-expose them to material they haven't learned yet by asking them to make hypotheses about it.",
    "examples": "Give a test summarizing the material > Spend additional time studying the same material\nGive a “pre-quiz” to expose students to upcoming math concepts and gauge progress > Jump straight in",
    "exampleGame": "Battleship Numberline",
    "exampleGameUrl": "https://www.brainpop.com/games/battleshipnumberline/",
    "exampleGameDesc": "Battleship Numberline is one of many K-12 math games that takes an approach of repetitive drilling (or quizzing) to ingrain concepts in the player’s mind. Time pressure and a display of average accuracy put some heat on the player.",
    "cited": "Pashler"
  },
  {
    "id": 5,
    "principle": "Segmenting",
    "subtitle": "Present lesson in learner-paced segments > As a continuous unit",
    "categoryId": 1,
    "gameId": 1,
    "categoryName": "Memory/Fluency",
    "related": "1, 2",
    "questions": "What are all of the skills that a player needs to succeed in your game?\nWhat are additional skills that a player needs to successfully apply those skills?\nWhat are additional skills that a player needs to successfully apply THOSE skills?\nHow will the game adjust to players with different learning paces?",
    "description": "Break material down into units in order to allow the player/learner to approach the material at their own pace.\nMath is not a skill, it is actually a collection of related skills that people can have different mastery of.",
    "examples": "Levels > One very long game\nA Portuguese lesson on verbs used in cooking > A very long, continuous curriculum on all Portuguese verbs"
  },
  {
    "id": 6,
    "principle": "Feedback",
    "subtitle": "Provide feedback during learning > No feedback provided",
    "categoryId": 1,
    "gameId": 6,
    "categoryName": "Memory/Fluency",
    "related": "14",
    "questions": "What are all the channels the game is using to communicate status to the player?\nHow many of these relate to their application of target concepts?\nHow does a player know how they are doing?\nWhat are some actions players can take after receiving a feedback?\nHow often should the feedback be provided?",
    "description": "Provide feedback to the player on their performance as they are learning.\nTiming of feedback may differ depending on the task being performed. Immediate feedback during play can be valuable to encourage or discourage behavior.",
    "examples": "A teacher provides detailed feedback on an essay > Just a letter grade",
    "exampleGame": "JobPro: Get Dressed!",
    "exampleGameUrl": "https://www.simcoachgames.com/jobpro/",
    "exampleGameDesc": "JobPro: Get Dressed! Is a mobile game created by Simcoach Games that trains players in how to dress for a job interview. Players choose an outfit based on the role they are interviewing for, the atmosphere of the company, and various other factors. After the player makes their selection they receive detailed feedback about the outfit they chose and its compatibility with the position.",
    "cited": "Graesser"
  },
  {
    "id": 7,
    "principle": "Pretraining",
    "subtitle": "Practice key prior skills before lesson > Jump in",
    "categoryId": 2,
    "gameId": 4,
    "categoryName": "Induction/Refinement",
    "related": "13",
    "questions": "What prior skills are required for this specific lesson?\nHow can these prior skills be practiced effectively before the lesson? Multiple short practices or one long practice?\nHow well should the players be trained in those prior skills?",
    "description": "Provide some exposure to key concepts before the actual lesson.",
    "examples": "Assign some readings before the lecture > Jump straight in\nStart choir with a warm-up that is in the same style as the song they group will learn that day > Jump straight in \nMake players practice writing one sentence at a time > Write a paragraph",
    "exampleGame": "Coding for Carrots",
    "exampleGameUrl": "https://www.google.com/doodles/celebrating-50-years-of-kids-coding",
    "exampleGameDesc": "Coding for Carrots is a drag-and-drop coding game that tells a story of a rabbit searches for carrots by completing the block building activity. There is a trial round before every official game. It offers pretraining of the skills that the game wants to test, and it also helps to set an expectation of the difficulty level for the players.",
    "cited": "Pashler"
  },
  {
    "id": 8,
    "principle": "Worked example",
    "subtitle": "Worked examples + problem-solving practice > Practice alone",
    "categoryId": 2,
    "gameId": 5,
    "categoryName": "Induction/Refinement",
    "related": "27",
    "questions": "How many or what type of worked examples can be provided for this lesson?\nHow can we make sure that players aren’t simply cloning the worked examples instead of solving the practices?",
    "description": "Combine problem-solving practice with reviewing examples of solved problems that illustrate the steps taken to reach a solution.\nHaving students alternate between reviewing worked examples and solving similar problems on their own has been shown to be effective when teaching math, science, and technology.",
    "examples": "A computer science student reviews code from a few similar projects while determining what approach she will take to do her homework assignment > She looks at the assignment and thinks about it really hard\nAn algebra textbook provides a worked example for each type of practice problem, using different variables and values > Descriptive text and practice problems only",
    "exampleGame": "Anti-Phishing Phil",
    "exampleGameUrl": "https://www.wombatsecurity.com/anti-phishing-training-suite",
    "exampleGameDesc": "Anti-Phishing Phil is a game that teaches users how to identify phishing URLs, where to look for cues in web browsers, and how to use search engines to find legitimate sites. Each module of the game begins with a non-interactive tutorial in which the player is presented with several worked examples of the types of problems they will need to solve.\n\nAnti-Phishing Phil was developed by members of the Carnegie Mellon University Usable Privacy and Security Laboratory with funding from the US National Science Foundation (Cyber Trust initiative) and ARO/CyLab.",
    "cited": "Pashler"
  },
  {
    "id": 9,
    "principle": "Concreteness fading",
    "subtitle": "Concrete to abstract representations > Starting with abstract",
    "categoryId": 2,
    "gameId": 4,
    "categoryName": "Induction/Refinement",
    "related": "8, 25",
    "questions": "What are some concrete/abstract representations of the concept?\nWhat is the target audience and how will this affect the choice of concrete representations?\nHow are some ways of bridging the concrete and abstract representations?",
    "description": "When explaining key concepts, use both abstract and concrete representations. \nDraw connections between the abstract and concrete examples, and highlight how they represent the same critical takeaways.\nConcrete representations can be effective for inciting initial understanding of a concept, but may not support transferring that knowledge to other concepts. Abstract representations may be more difficult to grasp initially, but have shown to foster the ability to put the same knowledge to use in very different domains. Therefore some experts recommend concreteness fading: introduce a concept with concrete examples, and over time replace key components of that example with more abstract representations.\n",
    "examples": "“Shelly needs 3 dozen eggs. X = the number of eggs she needs.” > “X = 3(12). “\nPlay through teh circle of 5ths on piano while following along on the diagram > Review a diagram of the circle of 5ths\nChocolate bar split into 4 equal pieces > ¼ ",
    "cited": "Pashler"
  },
  {
    "id": 10,
    "principle": "Guided attention",
    "subtitle": "Words include cues about organization > No organization cues",
    "categoryId": 2,
    "gameId": 4,
    "categoryName": "Induction/Refinement",
    "related": "19, 22",
    "questions": "What are some segments of the lesson or practice that could be ambiguous to players?\nWhat are some ways of explicitly stating the requirements?\nHow do we provide explicit instructions while keeping the players engaged? How can we give cues that won’t make the practices too easy or boring?",
    "description": "Provide explicit instructions as needed to help the player anticipate where they should focus their attention.\n Verbal cues may accompany visuals to describe unfamiliar objects, or explain unobvious processes. Each text description should be near the visual element it describes.",
    "examples": "A game with a tutorial and instructions > No text",
    "exampleGame": "Creature Capture",
    "exampleGameUrl": "http://play.centerforgamescience.org/creaturecapture/",
    "exampleGameDesc": "Creature Capture is a strategy game published by the University of Washington Center for Game Science. It teaches young children to compare their game fraction values with those of the computer-controlled virals. \nTo win the game, the player needs to pick a number that meets the requirement of the presented game cue. The game's interactive tutorial walks the player through each step of a round."
  },
  {
    "id": 11,
    "principle": "Linking",
    "subtitle": "Integrate instructional components > No integration",
    "categoryId": 2,
    "gameId": 1,
    "categoryName": "Induction/Refinement",
    "related": "2, 5",
    "questions": "How would a player describe what they learned from this game?\nWhat are some links between concepts your game teaches?\nHow important is it to explicitly draw connections?",
    "description": "Highlight connections between instructional units. \nExplicitly call out connections, similarities, and differences between previously learned and new material.",
    "examples": "In a philosophy course, make connections between philosophers and how their beliefs about key topics compare and contrast > Give an overview of each major philosopher",
    "exampleGame": "Human Resource Machine",
    "exampleGameUrl": "https://tomorrowcorporation.com/humanresourcemachine",
    "exampleGameDesc": "Human Resource Machine is a puzzle game that teaches programming. The player controls tiny office workers with simple programming to perform tasks dictated by a cruel manager. Each level builds upon the one before it and incorporates previously learned commands, explaining how the commands relate to each other and work together.\n"
  },
  {
    "id": 12,
    "principle": "Goldilocks",
    "subtitle": "Instruct at intermediate difficulty level > Too hard or too easy",
    "categoryId": 2,
    "gameId": 4,
    "categoryName": "Induction/Refinement",
    "related": "13, 30",
    "questions": "Who is your target player? \nHow much prior exposure do they have to this material?\nHow could you make the material harder? Easier?\nWhat is the goal of the game?",
    "description": "Account for the player’s prior knowledge and skill level when considering how challenging to make your game.",
    "examples": "Grade-level appropriate curriculum > Students find a chemistry game completely unapproachable because it involves math far above their grade level",
    "exampleGame": "Mario Kart",
    "exampleGameUrl": "https://www.nintendo.com/",
    "exampleGameDesc": "The classic multiplayer Nintendo game Mario Kart uses a unique approach to balancing the different skill levels of players. Players who are performing the worse will receive more powerful items, which are used to sabotage other players.",
    "cited": "Graesser"
  },
  {
    "id": 13,
    "principle": "Activate preconceptions",
    "subtitle": "Cue student's prior knowledge > No prior knowledge cues",
    "categoryId": 2,
    "gameId": 4,
    "categoryName": "Induction/Refinement",
    "related": "9, 12, 5, 2, 11",
    "questions": "What kinds of prior knowledge are required for this practice?\nWhat are some links between the prior knowledge and the new concepts?",
    "description": "Prompt players to examine what they already know (or think they know) to help contextualize new material.\nBuilding upon what your player already knows and/or is interested in can make the game accessible and engaging. ",
    "examples": "When explaining photosynthesis to a child, use a metaphor of how a person drinks milk through a straw like how a plant drinks water through its stem > Explain a brand new concept from scratch",
    "exampleGame": "A Slower Speed of Light",
    "exampleGameUrl": "http://gamelab.mit.edu/games/a-slower-speed-of-light/",
    "exampleGameDesc": "A Slower Speed of Light is a first-person game prototype developed by MIT Game Lab. A Slower Speed of Light is designed to build upon and challenge the average person’s understanding of how light travels. It begins with a very familiar experience: walking through a space at a human-like pace collecting objects. Picking up orbs reduces the speed of light in increments, triggering scientifically accurate visual effects."
  },
  {
    "id": 14,
    "principle": "Immediate Feedback timing",
    "subtitle": "Immediate feedback on errors > Delayed feedback",
    "categoryId": 2,
    "gameId": 5,
    "categoryName": "Induction/Refinement",
    "related": "6",
    "questions": "When players make mistakes, how do they know they’ve done so? When do you tell them? How long can a player go before realizing they need to turn back?\nHow can the feedback be provided? Visual? Auditory?\nHow can the players respond to the feedback? Are the errors immediately fixable? Or does it take more time to fix the error?",
    "description": "Provide immediate feedback on errors. ",
    "examples": "A musician plays a wrong note on guitar and hears the dissonance > A musician makes a mistake writing sheet music and later notices when playing through the line\nA child touches a hot skillet and burns her hand > A child knocks over a vase and is later scolded\nA computer science student makes a mistake and the line turns red as they type > The student presses the “compile” button, and gets an error message",
    "exampleGame": "Operation",
    "exampleGameUrl": "https://shop.hasbro.com/en-us",
    "exampleGameDesc": "Operation is a classic board game in which players perform “surgery” on a doll-shaped board, carefully extracting plastic objects from the body with a goal of not touching the board. If the player slips up and makes contact with the board a buzzer sounds immediately."
  },
  {
    "id": 15,
    "principle": "Interleaving",
    "subtitle": "Intermix practice on different skills > Block practice all at once",
    "categoryId": 2,
    "gameId": 1,
    "categoryName": "Induction/Refinement",
    "related": "1, 4",
    "questions": "What are different types of skills to be practiced?\nHow can the game easily transition from one topic to another?\nHow can some practices be combined to create an interdisciplinary practice?",
    "description": "Practice different skills at the same time, or in alternation.",
    "examples": "A dance teacher choreographs a piece combining different techniques that the class has learned this month for them to practice > Additional practice of the same techniques\nA yoga class mixes both yin and yang practices > Long holds only\nWhen studying for a standardized test, a student alternates between different sections (Reading, Writing, and Math) in varying orders > The student studies one section for three months and then moves on to the next",
    "exampleGame": "Ninja Kitchen",
    "exampleGameUrl": "https://ninjakitchengame.org/",
    "exampleGameDesc": "Ninja Kitchen is a restaurant serving game focusing on food safety. The player role plays a ninja server, and he/she learns to operate the restaurant through a mixture of smaller games targeting different perspectives, including dish washing, food preparing, serving, etc. The harder the game goes, the busier the restaurant runs. The players will practice all kinds of skills in later levels."
  },
  {
    "id": 16,
    "principle": "Application",
    "subtitle": "Practice applying new knowledge > No application",
    "categoryId": 2,
    "gameId": 6,
    "categoryName": "Induction/Refinement",
    "related": "3",
    "questions": "How much practice will it take for your player to understand the material?\nWhat are the components that are most important to remember?\nDoes your game offer enough practice of key skills?\n",
    "description": "Challenge the player to put their newly acquired knowledge to use solving problems.",
    "examples": "Practice playing newly learned chords on guitar > Study additional new chord shapes",
    "exampleGame": "Crayon Physics Deluxe",
    "exampleGameUrl": "http://www.crayonphysics.com/",
    "exampleGameDesc": "Players learn by doing in Crayon Physics Deluxe,  a 2D physics puzzle / sandbox game. Players draw their own solution to manipulate a ball to make contact with a star, and watch as their drawings come alive and obey the laws of physics.",
    "cited": "Merrill"
  },
  {
    "id": 17,
    "principle": "Variability",
    "subtitle": "Practice with varied instances > Similar instances",
    "categoryId": 2,
    "gameId": 6,
    "categoryName": "Induction/Refinement",
    "related": "15, 18",
    "questions": "Are you encouraging thinking about this concept from different perspectives?\nWill your player be able to transfer the knowledge they acquire to other domains?",
    "description": "Use multiple and varied examples to teach and practice the use of abstract concepts.\nNo two situations are ever exactly the same, so you should prepare your players to apply their knowledge in all the varied situations of life. ",
    "examples": "Point out the same music theory concept in classical, pop, and jazz music examples > Use only examples of classical music\nA parent explains a complex concept to a child using several varied metaphors > Use one example, and the child interprets it literally",
    "exampleGame": "Battleship Numberline",
    "exampleGameUrl": "https://www.brainpop.com/games/battleshipnumberline/",
    "exampleGameDesc": "Battleship Numberline is a game that prompts children to practice eyeballing ratios by marking a spot on a numberline. The game has modes for fractions, decimals, percentages, and \"mixed bag,\" prompting the player to apply the same skills to varied problems.",
    "cited": "Graesser"
  },
  {
    "id": 18,
    "principle": "Comparison",
    "subtitle": "Compare multiple instances > Only one instance",
    "categoryId": 3,
    "gameId": 6,
    "categoryName": "Sense-making/Understanding",
    "related": "17",
    "questions": "What are some commonalities across all variables of instances?\nHow can the game encourage players to find similarities/differences?",
    "description": "Use multiple examples to explain a new concept, and highlight similarities and differences between the examples.",
    "examples": "Point out the same music theory concept in classical, pop, and jazz music examples, and point out similarities and differences in how it is used > Use only examples of classical music"
  },
  {
    "id": 19,
    "principle": "Multimedia",
    "subtitle": "Graphics + verbal descriptions > Verbal descriptions alone",
    "categoryId": 3,
    "gameId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "20, 21, 2, 23",
    "questions": "How can this particular description presented in a different way using graphics?\nWhat are some graphics that can improve player experience?\nWhat are some graphics that can help organize the content presented?",
    "description": "Use visual aids to enhance verbal descriptions.",
    "examples": "A visualization of median income by state > A list alone\nA labeled map accompanying a description of Egyptian trade routes > Description alone",
    "cited": "Pashler"
  },
  {
    "id": 20,
    "principle": "Modality principle",
    "subtitle": "Verbal descriptions presented in audio > In written form",
    "categoryId": 3,
    "gameId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "19, 21, 22, 23",
    "questions": "What descriptions can or cannot be fully presented in audio?\nHow quickly should the descriptions presented in audio?",
    "description": "Present verbal descriptions in audio rather than text when possible.\nPlayers may find their attention divided when presented with written text and competing visuals simultaneously.",
    "examples": "A safety training course with spoken narration > Written instructions\nWatching a documentary with sound > On mute with subtitles",
    "exampleGame": "Civilization (Franchise)",
    "exampleGameUrl": "https://civilization.com/",
    "exampleGameDesc": "Civilization is a turn-based strategy game (and/or resource management game) in which the player builds a civilization from scratch, starting in the Ancient Era.\nCiv frequents the modality principle; for key events, a character will read the text aloud while a graphic is shown. The voice that reads the information is typically anchored in reality by being linked to a character and scenario, either the advisor (a character who guides the player through the rules of Civ) or an explorer.",
    "cited": "Pashler"
  },
  {
    "id": 21,
    "principle": "Redundancy",
    "subtitle": "Verbal descriptions in audio > Both audio & written",
    "categoryId": 3,
    "gameId": 2,
    "categoryName": "Sense-making/Understanding",
    "related": "19, 20, 22, 23",
    "questions": "What descriptions can or cannot be fully presented in audio?\nShould the verbal descriptions be completely or partially removed?",
    "description": "If you are able to provide verbal descriptions in audio, refrain from also including those same instructions in written form.",
    "examples": "Watching a documentary with sound > Sound and subtitles\nA presentation that is delivered verbally with accompanying visuals, but no text > Redundant text"
  },
  {
    "id": 22,
    "principle": "Spatial contiguity",
    "subtitle": "Present description next to image element described > Separated",
    "categoryId": 3,
    "gameId": 3,
    "categoryName": "Sense-making/Understanding",
    "related": "10",
    "questions": "What are some presented images that require verbal descriptions?\nHow can we format/place the description relative the image?\nWhat is the purpose of the description for the image? Is it purely informational or does it have other purposes?",
    "description": "Position descriptive text as closely as possible to the part of the visualization it describes.",
    "examples": "A diagram is located inline with the text it supports > Reader has to flip forward several pages to find diagram 1.7\nTooltips are used to provide more information on elements of a data visualization > Visit a \"help\" section for more info",
    "cited": "Pashler"
  },
  {
    "id": 23,
    "principle": "Temporal contiguity",
    "subtitle": "Present audio & image element at the same time > Separated",
    "categoryId": 3,
    "gameId": 3,
    "categoryName": "Sense-making/Understanding",
    "questions": "What are the audio & image elements required for this practice?\nWhich audio elements are related to which image elements?",
    "description": "Present complementary audio and visual elements at the same time to encourage the player to form a connection between the two stimuli.",
    "examples": "Show photographs from the great depression while lecturing > Photographs reviewed later",
    "cited": "Mayer"
  },
  {
    "id": 24,
    "principle": "Coherence",
    "subtitle": "Extraneous words, pictures, sounds excluded > Included",
    "categoryId": 3,
    "gameId": 2,
    "categoryName": "Sense-making/Understanding",
    "related": "30",
    "questions": "What are your player's purposes?\nHow do those purposes support your learning goal?\nWhat are some words, pictures, or sounds that are essential for the practice?\nHow can we combine or summarize some information to convey the same information in a simpler way?\nWhen do the players feel like there’s “too much” information?",
    "description": "Refrain from including extraneous words, pictures, and sounds that do not serve the purpose of your game.",
    "examples": "A powerpoint presentation contains purposeful words and images only > Includes lots of decorative illustrations that students pay more attention to than the actual lesson\nA passage about removing ticks from animals features an illustration demonstrating proper tick removal technique > A picture of a cute dog",
    "exampleGame": "Septris",
    "exampleGameUrl": "http://med.stanford.edu/septris/",
    "exampleGameDesc": "Septris is an educational tool created by Stanford Hospital to train medical and surgical staff to diagnose, classify, and treat sepsis according to best practices. The Septris user-interface is sparse, mimicking a patient’s medical chart. The player faces the challenge of parsing a lot of information without any extraneous graphics or imagery."
  },
  {
    "id": 25,
    "principle": "Anchored learning",
    "subtitle": "Real-world problems > Abstract problems",
    "categoryId": 3,
    "gameId": 2,
    "categoryName": "Sense-making/Understanding",
    "related": "9, 8",
    "questions": "What is the real-world connection?\nHow does the player’s in-game progress impact their real-world life?\nHow is what the player does in your game like what they would do in real life? How is it different?\nWhat are some real life applications of the skills being practiced?\nHow can players relate the new skills learned in their own lives?",
    "description": "Engage the player in realistic rather than theoretical problem-solving, and emphasize the connections between the game and the real world.",
    "examples": "Instruct middle schoolers in an economics course to build a hypothetical portfolio of stocks and watch those stocks over the course of the semester > Study fictional problems of market fluctuation\nA student project of building an assistive device for a real person > Building a double transducer",
    "exampleGame": "Lift Coach: Plan Your Lift",
    "exampleGameUrl": "https://www.amazon.com/Lift-Coach-Plan-Your/dp/B076FFL8CJ",
    "exampleGameDesc": "Lift Coach is a game that educates people to use safe postures to lift and move objects. Players can correct how on-screen character lifts objects, and the goal is to avoid unsafe actions might lead to injuries. Lifting is such a common daily activity, but not many have paid attention to it. By referring back to real life cases, people will have an easier time to understand the mechanism behind and how to protect themselves in real hard-lifting scenarios.",
    "cited": "Merrill, Culyba"
  },
  {
    "id": 26,
    "principle": "Metacognition",
    "subtitle": "Metacognition supported > No support for metacognition",
    "categoryId": 3,
    "gameId": 6,
    "categoryName": "Sense-making/Understanding",
    "related": "6, 4, 27, 28",
    "questions": "How should players be different after playing your game?\nHow will your player measure your game’s impact?\nWhat are your player’s strengths and weaknesses?  How can they see them?\nWhat parts of the game are particularly effective or relevant to your player personally?",
    "description": "Empower the player to self-reflect and self-correct.\nEngage the player in their own learning experience.",
    "examples": "An elearning course gives the same test at the beginning and end to show the student their progress > No measure of progress\nA time-management app encourages the user to set custom goals and reflect upon their progress on a weekly basis > No opportunity for reflection\nA programming tutorial gives near-immediate feedback on errors in the beginning, and gradually transitions into more delayed feedback to allow the student to recognize and troubleshoot their own mistakes > No opportunity to self-correct",
    "exampleGame": "Windfall",
    "exampleGameUrl": "http://persuasivegames.com/game/windfall",
    "exampleGameDesc": "Windfall is a strategy game about building wind turbines to create energy profitably. Players strategically choose locations to build turbines to maximize profit without losing public support. At the end of each year player’s are presented with a summary of their progress towards their energy offset goal, and the game pauses encouraging the player to reflect and plan for the next round.",
    "cited": "Culyba"
  },
  {
    "id": 27,
    "principle": "Explanation",
    "subtitle": "Prompt for self-explanation > Give explanation > No prompt",
    "categoryId": 3,
    "gameId": 5,
    "categoryName": "Sense-making/Understanding",
    "related": "26, 28",
    "questions": "What are the causal relationships between the concepts being explored?\nWhen are players making decisions regarding their learning that require independent thinking?\nWhen are players given chances to self-explain?\nWhat type of feedback can be provided after they have self-explained?",
    "description": "Prompt the player to reason through the underlying explanatory principles relating to the subject matter being explored.\nEncourage the player to reflect upon their own problem-solving process and challenge, explain, and defend their choices.",
    "examples": "Have a student show their work on an algebra problem > Show a worked problem > Show solution only",
    "exampleGame": "SET",
    "exampleGameUrl": "https://www.setgame.com/set",
    "exampleGameDesc": "SET is a cognitive, logical reasoning game. A SET is three cards which share a common feature, such as color or shape. The player who finds the most SETs within the timeframe wins the game. Since every player has his/her own understanding of how to make up the SET, each will prompt to explain their thoughts and definition.",
    "cited": "Astleitner, Pashler"
  },
  {
    "id": 28,
    "principle": "Questioning",
    "subtitle": "Time for reflection & questioning > Instruction alone",
    "categoryId": 3,
    "gameId": 5,
    "categoryName": "Sense-making/Understanding",
    "related": "26, 27",
    "questions": "Does the game provide opportunities to reflect?\nHas the player acquired sufficient subject knowledge to ask deep questions?\nIn what ways could a player check their understanding through the game?\nWhat are some ways of motivating the players to question things?\nWhat type of questions will be effective for stimulating critical thinking?",
    "description": "Empower your player to embrace and explore uncertainties they encounter.\nEncourage the player to take time to reflect and ask deep questions; questions that stimulate deep explanations, and may challenge their prior beliefs and assumptions.",
    "examples": "Ask students: What is data? What isn’t data? > Ask students: What is the correct data type to use for a single character?\nAsk students: What might the world look like today if the war had ended differently? > Ask students: What year did the American Revolutionary War end?",
    "exampleGame": "Survival of the Best Fit",
    "exampleGameUrl": "https://www.survivalofthebestfit.com/game/",
    "exampleGameDesc": "Survival of the Best Fit is a short game designed to teach people to understand algorithmic bias, and prompt them to ask tough questions about their own biases. The game features a series of short segments with periodic breaks to reflect on what just happened and why they made the decisions they made.",
    "cited": "Astleitner, Pashler"
  },
  {
    "id": 29,
    "principle": "Cognitive dissonance",
    "subtitle": "Present incorrect or alternative perspective > Only correct",
    "categoryId": 3,
    "gameId": 5,
    "categoryName": "Sense-making/Understanding",
    "related": "18",
    "questions": "How objective or subjective is the material being taught?\nHow many ways are there to approach the challenges in your game? How many are players likely to encounter themselves?\nHow can  the player recognize mistakes or misuse of the material?",
    "description": "Present incorrect or alternative perspectives of the subject matter to afford the player the opportunity to form arguments around key concepts.",
    "examples": "Show an example of a common misconception and explain why it is false > Correct examples only"
  },
  {
    "id": 30,
    "principle": "Interest",
    "subtitle": "Instruction relevant to student interests > Not relevant",
    "categoryId": 3,
    "gameId": 2,
    "categoryName": "Sense-making/Understanding",
    "related": "13, 24",
    "questions": "Who is your target player? What motivates them?\nDoes your player have a personal stake in their transformation?\nWhat is the ecosystem in which your game must create change?",
    "description": "Engage your player by structuring content around their interests and goals.",
    "examples": "Allow guitar students to choose their own songs to learn > Forced set of songs",
    "exampleGame": "Alphabear",
    "exampleGameUrl": "https://play.google.com/store/apps/details?id=com.spryfox.alphabear2&hl=en_US",
    "exampleGameDesc": "Alphabear is a word puzzle game that teaches spelling, and captures the player’s attention with an engaging storyline. As the player spells a word, that word is animated in a funny cartoon. Players are able to customize their characters and switch out props and outfits.",
    "cited": "Culyba"
  }
]
